# ExtrusionAnalyzer Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExtrusionAnalyzer Methods
ExtrusionAnalyzer Class See Also
---
The ExtrusionAnalyzer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CalculateFaceAlignment | Calculates the alignment status of each face of the solid. |
| Create | Creates an ExtrusionAnalyzer and computes and stores the solid's shadow. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetExtrusionBase | Obtains the face that represents the base contour of the extrusion analysis. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ExtrusionAnalyzer Class
Autodesk.Revit.DB Namespace